; domain
;; domain.pddl
(define (domain lamento-drago-ghiaccio)
  (:requirements :strips :typing)

  (:types
    agente luogo artefatto
    eroe drago - agente
  )

  (:predicates
    ;; Predicati di posizione
    (at ?a - agente ?l - luogo)
    (at-artefatto ?art - artefatto ?l - luogo)

    ;; Predicati di stato dell'eroe
    (ha-fiamma ?h - eroe)

    ;; Predicati di stato del drago
    (corrotto ?d - drago)
    (purificato ?d - drago)

    ;; Predicati di stato del mondo e ostacoli
    (connesso ?from - luogo ?to - luogo)
    (sentiero-bloccato ?from - luogo ?to - luogo)
    (guardato-da-guardiani ?l - luogo)
  )

  ;; Azione per muoversi tra due luoghi sicuri
  (:action muovi
    :parameters (?h - eroe ?from - luogo ?to - luogo)
    :precondition (and
      (at ?h ?from)
      (connesso ?from ?to)
      (not (sentiero-bloccato ?from ?to))
      (not (guardato-da-guardiani ?to)) ; Non ci si può muovere verso un luogo guardato
    )
    :effect (and
      (not (at ?h ?from))
      (at ?h ?to)
    )
  )

  ;; Azione per attraversare un luogo sorvegliato, sconfiggendo i guardiani
  (:action supera-guardiani
    :parameters (?h - eroe ?from - luogo ?to - luogo)
    :precondition (and
      (at ?h ?from)
      (connesso ?from ?to)
      (not (sentiero-bloccato ?from ?to))
      (guardato-da-guardiani ?to) ; Il luogo di destinazione deve essere guardato
    )
    :effect (and
      (not (at ?h ?from))
      (at ?h ?to)
      (not (guardato-da-guardiani ?to)) ; I guardiani vengono sconfitti all'arrivo
    )
  )

  ;; Azione per raccogliere la Fiamma Eterna
  (:action raccogli-fiamma-eterna
    :parameters (?h - eroe ?f - artefatto ?l - luogo)
    :precondition (and
      (at ?h ?l)
      (at-artefatto ?f ?l)
    )
    :effect (and
      (ha-fiamma ?h)
      (not (at-artefatto ?f ?l))
    )
  )

  ;; Azione finale per purificare il drago usando la Fiamma Eterna
  (:action purifica-drago
    :parameters (?h - eroe ?d - drago ?l - luogo)
    :precondition (and
      (at ?h ?l)
      (at ?d ?l)
      (ha-fiamma ?h)
      (corrotto ?d)
    )
    :effect (and
      (not (corrotto ?d))
      (purificato ?d)
    )
  )
)

; problem
;; problem.pddl
(define (problem spezzare-maledizione-glaurung)
  (:domain lamento-drago-ghiaccio)

  (:objects
    eroe1 - eroe
    glaurung - drago
    fiamma-eterna - artefatto
    villaggio crepacci-ghiacciati picco-gelido - luogo
  )

  (:init
    ;; Posizioni iniziali degli agenti e degli artefatti
    (at eroe1 villaggio)
    (at glaurung picco-gelido)
    (at-artefatto fiamma-eterna villaggio)

    ;; Stato iniziale del drago
    (corrotto glaurung)

    ;; Connessioni tra i luoghi (la mappa del mondo)
    (connesso villaggio crepacci-ghiacciati)
    (connesso crepacci-ghiacciati villaggio)
    (connesso crepacci-ghiacciati picco-gelido)
    (connesso picco-gelido crepacci-ghiacciati)

    ;; Ostacoli presenti nel mondo
    (guardato-da-guardiani crepacci-ghiacciati)
  )

  (:goal (and
    (purificato glaurung)
  ))
)

; plan
1. (raccogli-fiamma-eterna eroe1 fiamma-eterna villaggio)
   deleted: (at-artefatto fiamma-eterna villaggio)
   added: (ha-fiamma eroe1)
   goals met: 0 of 1
2. (supera-guardiani eroe1 villaggio crepacci-ghiacciati)
   deleted: (at eroe1 villaggio) (guardato-da-guardiani crepacci-ghiacciati)
   added: (at eroe1 crepacci-ghiacciati)
   goals met: 0 of 1
3. (muovi eroe1 crepacci-ghiacciati picco-gelido)
   deleted: (at eroe1 crepacci-ghiacciati)
   added: (at eroe1 picco-gelido)
   goals met: 0 of 1
4. (purifica-drago eroe1 glaurung picco-gelido)
   deleted: (corrotto glaurung)
   added: (purificato glaurung)
   goals met: 1 of 1
